HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxQspi_reg.h
/**
 * \file IfxQspi_reg.h
 * \brief
 * \copyright Copyright (c) 2014 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC27XA_TS_V3.0.1.R2
 * Specification: TC27xA_TS_V3.0.1_SFR_OPEN_MARKET.xml (Revision: V3.0.1)
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Qspi_Cfg Qspi address
 * \ingroup IfxLld_Qspi
 * 
 * \defgroup IfxLld_Qspi_Cfg_BaseAddress Base address
 * \ingroup IfxLld_Qspi_Cfg
 * 
 * \defgroup IfxLld_Qspi_Cfg_Qspi0 2-QSPI0
 * \ingroup IfxLld_Qspi_Cfg
 * 
 * \defgroup IfxLld_Qspi_Cfg_Qspi1 2-QSPI1
 * \ingroup IfxLld_Qspi_Cfg
 * 
 * \defgroup IfxLld_Qspi_Cfg_Qspi2 2-QSPI2
 * \ingroup IfxLld_Qspi_Cfg
 * 
 * \defgroup IfxLld_Qspi_Cfg_Qspi3 2-QSPI3
 * \ingroup IfxLld_Qspi_Cfg
 * 
 * \defgroup IfxLld_Qspi_Cfg_Qspi4 2-QSPI4
 * \ingroup IfxLld_Qspi_Cfg
 * 
 */
#ifndef IFXQSPI_REG_H
#define IFXQSPI_REG_H 1
/******************************************************************************/
#include "IfxQspi_regdef.h"
/******************************************************************************/
/** \addtogroup IfxLld_Qspi_Cfg_BaseAddress
 * \{  */

/** \\brief  QSPI object */
#define MODULE_QSPI0 /*lint --e(923)*/ ((*(Ifx_QSPI*)0xF0001C00u))

/** \\brief  QSPI object */
#define MODULE_QSPI1 /*lint --e(923)*/ ((*(Ifx_QSPI*)0xF0001D00u))

/** \\brief  QSPI object */
#define MODULE_QSPI2 /*lint --e(923)*/ ((*(Ifx_QSPI*)0xF0001E00u))

/** \\brief  QSPI object */
#define MODULE_QSPI3 /*lint --e(923)*/ ((*(Ifx_QSPI*)0xF0001F00u))

/** \\brief  QSPI object */
#define MODULE_QSPI4 /*lint --e(923)*/ ((*(Ifx_QSPI*)0xF0002000u))
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Qspi_Cfg_Qspi0
 * \{  */

/** \\brief  FC, Access Enable Register 0 */
#define QSPI0_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ACCEN0*)0xF0001CFCu)

/** \\brief  F8, Access Enable Register 1 */
#define QSPI0_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ACCEN1*)0xF0001CF8u)

/** \\brief  18, Basic Configuration Register */
#define QSPI0_BACON /*lint --e(923)*/ (*(volatile Ifx_QSPI_BACON*)0xF0001C18u)

/** \\brief  60, BACON_ENTRY Register */
#define QSPI0_BACONENTRY /*lint --e(923)*/ (*(volatile Ifx_QSPI_BACONENTRY*)0xF0001C60u)

/** \\brief  1C, Basic Configuration Register 1 */
#define QSPI0_BACONPWM /*lint --e(923)*/ (*(volatile Ifx_QSPI_BACONPWM*)0xF0001C1Cu)

/** \\brief  0, Clock Control Register */
#define QSPI0_CLC /*lint --e(923)*/ (*(volatile Ifx_QSPI_CLC*)0xF0001C00u)

/** \\brief  64, DATA_ENTRY Register */
#define QSPI0_DATAENTRY0 /*lint --e(923)*/ (*(volatile Ifx_QSPI_DATAENTRY*)0xF0001C64u)

/** \\brief  68, DATA_ENTRY Register */
#define QSPI0_DATAENTRY1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_DATAENTRY*)0xF0001C68u)

/** \\brief  6C, DATA_ENTRY Register */
#define QSPI0_DATAENTRY2 /*lint --e(923)*/ (*(volatile Ifx_QSPI_DATAENTRY*)0xF0001C6Cu)

/** \\brief  70, DATA_ENTRY Register */
#define QSPI0_DATAENTRY3 /*lint --e(923)*/ (*(volatile Ifx_QSPI_DATAENTRY*)0xF0001C70u)

/** \\brief  74, DATA_ENTRY Register */
#define QSPI0_DATAENTRY4 /*lint --e(923)*/ (*(volatile Ifx_QSPI_DATAENTRY*)0xF0001C74u)

/** \\brief  78, DATA_ENTRY Register */
#define QSPI0_DATAENTRY5 /*lint --e(923)*/ (*(volatile Ifx_QSPI_DATAENTRY*)0xF0001C78u)

/** \\brief  7C, DATA_ENTRY Register */
#define QSPI0_DATAENTRY6 /*lint --e(923)*/ (*(volatile Ifx_QSPI_DATAENTRY*)0xF0001C7Cu)

/** \\brief  80, DATA_ENTRY Register */
#define QSPI0_DATAENTRY7 /*lint --e(923)*/ (*(volatile Ifx_QSPI_DATAENTRY*)0xF0001C80u)

/** \\brief  20, Configuration Extension */
#define QSPI0_ECON0 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0001C20u)

/** \\brief  24, Configuration Extension */
#define QSPI0_ECON1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0001C24u)

/** \\brief  28, Configuration Extension */
#define QSPI0_ECON2 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0001C28u)

/** \\brief  2C, Configuration Extension */
#define QSPI0_ECON3 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0001C2Cu)

/** \\brief  30, Configuration Extension */
#define QSPI0_ECON4 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0001C30u)

/** \\brief  34, Configuration Extension */
#define QSPI0_ECON5 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0001C34u)

/** \\brief  38, Configuration Extension */
#define QSPI0_ECON6 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0001C38u)

/** \\brief  3C, Configuration Extension */
#define QSPI0_ECON7 /*lint --e(923)*/ (*(volatile Ifx_QSPI_ECON*)0xF0001C3Cu)

/** \\brief  54, Flags Clear Register */
#define QSPI0_FLAGSCLEAR /*lint --e(923)*/ (*(volatile Ifx_QSPI_FLAGSCLEAR*)0xF0001C54u)

/** \\brief  10, Global Configuration Register */
#define QSPI0_GLOBALCON /*lint --e(923)*/ (*(volatile Ifx_QSPI_GLOBALCON*)0xF0001C10u)

/** \\brief  14, Global Configuration Register 1 */
#define QSPI0_GLOBALCON1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_GLOBALCON1*)0xF0001C14u)

/** \\brief  8, Module Identification Register */
#define QSPI0_ID /*lint --e(923)*/ (*(volatile Ifx_QSPI_ID*)0xF0001C08u)

/** \\brief  50, Inject Register */
#define QSPI0_INJECT /*lint --e(923)*/ (*(volatile Ifx_QSPI_INJECT*)0xF0001C50u)

/** \\brief  F4, Kernel Reset Register 0 */
#define QSPI0_KRST0 /*lint --e(923)*/ (*(volatile Ifx_QSPI_KRST0*)0xF0001CF4u)

/** \\brief  F0, Kernel Reset Register 1 */
#define QSPI0_KRST1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_KRST1*)0xF0001CF0u)

/** \\brief  EC, Kernel Reset Status Clear Register */
#define QSPI0_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_QSPI_KRSTCLR*)0xF0001CECu)

