HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxQspi_reg.h
/** \\brief  10, Global Configuration Register */
#define QSPI4_GLOBALCON /*lint --e(923)*/ (*(volatile Ifx_QSPI_GLOBALCON*)0xF0002010u)

/** \\brief  14, Global Configuration Register 1 */
#define QSPI4_GLOBALCON1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_GLOBALCON1*)0xF0002014u)

/** \\brief  8, Module Identification Register */
#define QSPI4_ID /*lint --e(923)*/ (*(volatile Ifx_QSPI_ID*)0xF0002008u)

/** \\brief  50, Inject Register */
#define QSPI4_INJECT /*lint --e(923)*/ (*(volatile Ifx_QSPI_INJECT*)0xF0002050u)

/** \\brief  F4, Kernel Reset Register 0 */
#define QSPI4_KRST0 /*lint --e(923)*/ (*(volatile Ifx_QSPI_KRST0*)0xF00020F4u)

/** \\brief  F0, Kernel Reset Register 1 */
#define QSPI4_KRST1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_KRST1*)0xF00020F0u)

/** \\brief  EC, Kernel Reset Status Clear Register */
#define QSPI4_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_QSPI_KRSTCLR*)0xF00020ECu)

/** \\brief  4C, Mask Register */
#define QSPI4_MASK /*lint --e(923)*/ (*(volatile Ifx_QSPI_MASK*)0xF000204Cu)

/** \\brief  5C, MIX_ENTRY Register */
#define QSPI4_MIXENTRY /*lint --e(923)*/ (*(volatile Ifx_QSPI_MIXENTRY*)0xF000205Cu)

/** \\brief  E8, OCDS Control and Status */
#define QSPI4_OCS /*lint --e(923)*/ (*(volatile Ifx_QSPI_OCS*)0xF00020E8u)

/** \\brief  4, Port Input Select Register */
#define QSPI4_PISEL /*lint --e(923)*/ (*(volatile Ifx_QSPI_PISEL*)0xF0002004u)

/** \\brief  90, RX_EXIT Register */
#define QSPI4_RXEXIT /*lint --e(923)*/ (*(volatile Ifx_QSPI_RXEXIT*)0xF0002090u)

/** \\brief  48, Slave Select Output Control Register */
#define QSPI4_SSOC /*lint --e(923)*/ (*(volatile Ifx_QSPI_SSOC*)0xF0002048u)

/** \\brief  40, Status Register */
#define QSPI4_STATUS /*lint --e(923)*/ (*(volatile Ifx_QSPI_STATUS*)0xF0002040u)

/** \\brief  44, Status Register 1 */
#define QSPI4_STATUS1 /*lint --e(923)*/ (*(volatile Ifx_QSPI_STATUS1*)0xF0002044u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXQSPI_REG_H */
